/*
6) Обчислити силу притягання
(в науковому форматі) між двома тілами,
що мають маси m 1 ,m 2 , на відстані r. Вказівка. Шукана силa визначається
за формулою F=γ*m 1 *m 2 /r 2 , де γ = 6.673*10 -11 Н*м 2 /кг 2 . Всі потрібні змінні
присвоюються всередині програми. Результат вивести в окремому рядку
вигляду «F=*** », де замість зірок предствлення в науковому
(експоненційному) вигляді

*/
 // Classwork: task6.c - task0.pdf 
#include <stdio.h>

int main(){

  long double m1, m2, F, r, gamma = 6.673e-11L;
  //gamma = 6.673L/100000000000;

 /* m1 = 1000;
  m2 = 1000.23456;
  r = 101.0;
*/
  scanf("%Lf", &m1);
  scanf("%Lf", &m2);
  scanf("%Lf", &r);

  F = gamma* m1* m2 / (r * r); 
  printf("F = %Le or %Lg", F, F);
}
